import { ResourceLanguage } from 'i18next';

export const RU_I18N: ResourceLanguage = {
  translation: {
    create: 'Создание персонажа',
    createDescription:
      'Вам необходимо описать вашего персонажа, придумать ему имя, пол, описание и другие дополнительные заметки.',
    back: 'Назад',
    selectPriority: 'К выбору приоритетов',
    fillName: 'Имя персонажа',
    fillDescription: 'Описание персонажа',
    namePlaceholder: 'Джей Кокс',
    appearancePlaceholder:
      'Красив как бог, рыжие и длинные кудри, глаза как небо, немного люменесцентны',
    descriptionPlaceholder:
      'Мой персонаж был рожден в огне, пережил две войны и вернулся на волю',
    genderPlaceholder: 'Мужской',
    genderLabel: 'Выберите пол персонажа',
    appearanceLabel: 'Опишите внешность вашего персонажа',
    male: 'Мужской',
    female: 'Женский',
    other: 'Другой',
    requiredError: 'Необходимо заполнить поле',
    createPriority: 'Таблица приоритетов',
    descriptionPriority:
      'В данном разделе вам необходимо распределить приоритеты для вашего персонажа, тут вы решите будет ли ваш персонаж орком или трллем, полноценным магом или адептом и тп',
    detailPriority:
      'В каждой категории вы можете выбрать только одно, каждый следующий приоритет понижает эффективность',
    next: 'Далее',
    fullMage: 'Полноценный маг',
    aspectMage: 'Аспектный маг',
    adeptMage: 'Адепт',
    createFullMage: 'К созданию полноценного мага',
    createAspectMage: 'К созданию аспектного мага',
    createAdeptMage: 'К созданию адепта',
    priorityNext: 'К распределению аттрибутов',
    attributeTitle: 'Распределение аттрибутов',
    attributeDescription:
      'Аттрибуты вам необходимы для различных проверок, например аттрибут "Сила" будет использоваться, когда вы делаете что то связанное с физической силой',
    attributeNext: 'К распределению умений',
    skillTitle: 'Распределение умений',
    skillDescription:
      'Умения важная часть игры, они вам помогают справляться с различными ситуациями в игре, например навык "Компьютеры" помогает вам разбираться с компьютерами, делать различные манипуляции с ними. Выбирайте умения под свой стиль игры',
    skillNext: 'К распределению знаний',
    knowledgeTitle: 'Распределение знаний',
    knowledgeDescription:
      'Знания расширяют бекграунд вашего персонажа, придумывайте знания в любой форме, любые знания могут пригодиться',
    knowledgeNext: 'К распределению ресурсов',
    resourceTitle: 'Распределение ресурсов',
    resourceDescription:
      'В данный раздел входят различные игровые приспособления, которые помогут вам выбрать персонажа, которого вы хотите отыграть. Тут вы выберите уровень жизни персонажа, киберимпланты, броню, оружие и транспорт',
    finish: 'Закончить создание персонажа',
    human: 'Человек',
    elven: 'Эльф',
    troll: 'Тролль',
    dwarf: 'Дворф',
    orc: 'Орк',
    priorityLabel: 'Приоритет',
    magicalCreateTitle: 'Магия',
    raceCreateTitle: 'Раса',
    attributeCreateTitle: 'Аттрибуты',
    attributeDetailTitle: 'Аттрибуты',
    skillCreateTitle: 'Умения',
    resourceCreateTitle: 'Ресурсы',
    select: 'Выбрать',
    fullMagicalDescription: `Такие маги способны колдовать (Колдовство), вызывать духов (Призывание), использовать магические фоки, воспринимать астрал и проецировать в астральное пространство.\n
      Данные маги являются максимально пробужденными.\n
      Разделяются эти маги на два раздела:`,
    fullMagicalGermetic: 'Маги герметиской традиции',
    fullMagicalShaman: 'Маги шаманы',
    fullMagicalShamanDescription: `Магия шамана происходит от силы природы и духовного
    мира (астрального плана). Племенные культуры по всему миру
    практикуют шаманизм. Когда Пробуждение принесло в мир
    магию, природные шаманы одними из первых успешно ею
    овладели. Шаманизм также развивался во многих городских
    районах во время бума оккультизма в конце 20-го века. Когда
    пришло Пробуждение, эти «городские шаманы» обнаружили,
    что старые методы работают в городах так же хорошо, как и в
    дикой местности.
    Для шамана мир наполнен живыми духами, силами, которые
    он способен призывать в качестве магической помощи. Шаманы настроены на естественный поток энергий жизни и магии.`,
    fullMagicalGermeticDescription: `Маги проводят много исследований и используют обширные справочные библиотеки. Герметическая библиотека – это
    собрание руководств по определенному магическому умению.
    Существуют отдельные библиотеки для Колдовства и Призывания. У библиотеки есть свой рейтинг, как и у умения, к которому
    она относится, показывающий, насколько она полна и полезна.
    В двадцать первом веке печать почти мертва. Некоторые
    маги настолько старомодны, что предпочитают иметь бумажные книги в своих библиотеках, в то время как другие пользуются современным удобством цифровых носителей, сохраняя
    свои библиотеки на оптических чипах или компакт-дисках. Печатные книги громоздки и занимают много места, но ими можно
    пользоваться в любое время без компьютера. В конечном счете
    важна информация в герметической библиотеке, а не носитель,
    на котором она хранится.`,
    attributeDetailDescription: `Атрибуты нужны для различных проверок, и ваш рейтинг
    Атрибута – это количество кубиков, которые вы бросаете при прохождении определенной проверки.
    Атрибуты персонажа – Тело, Быстрота, Сила, Харизма, Интеллект
    и Сила воли – представляют собой
    каркас, на котором зиждется любой
    персонаж: его тело, то, что персонаж сделал с этим телом, и то, что
    находится внутри героя, делая его
    уникальным. Поскольку Атрибуты
    можно улучшать в течение жизни
    персонажа, они представляют собой
    нечто большее, чем просто генетику.`,
    attributeCount: 'Количество атрибутов для использования',
    selected: 'Выбрано',
    skillDetailDescription: ``,
    skillsCount: 'Количество умений для использования',
    close: 'Закрыть',
    attributePhysical: 'Физические',
    attributeMental: 'Ментальные',
    attributeSpecial: 'Особые',
    attributeBody: 'Тело',
    attributeDexterity: 'Быстрота',
    attributeStrength: 'Сила',
    attributeCharisma: 'Харизма',
    attributeIntellect: 'Интеллект',
    attributeWillPower: 'Сила воли',
    attributeEntity: 'Сущность',
    attributeMagic: 'Магия',
    attributeReaction: 'Реакция',
    attributeBodyDescription: `Атрибут Тела определяет сопротивляемость персонажа
    внешним физическим воздействиям. Он охарактеризовывает сердечно-сосудистую систему и выносливость персонажа,
    его иммунную систему, то, насколько быстро он исцеляется,
    насколько хорошо он приспосабливается к биовэру, его терпимость в отношении наркотиков и алкоголя и, в некоторой
    степени, его мышечную и костную структуру и вес. Низкий параметр Тела может означать, что персонаж худой и хрупкий,
    или же плохо питается или имеет проблемы со здоровьем. У
    персонажа, поправляющегося после неприятной болезни или
    обширной киберхирургической операции, также может быть
    низкое Тело. Высокое Тело означает, что персонаж лучше питается, крепок как гвоздь, у него прочные, упругие кости и иммунная система, которую так просто не одолеешь`,
    attributeDexterityDescription: `Быстрота представляет собой двигательные рефлексы персонажа, его равновесие, обмен веществ, скорость бега, гибкость и координацию. Персонаж с низкой Быстротой может
    быть трид-овощем, иметь проблемы с внутренним ухом или
    просто иметь склонность застывать в чрезвычайной ситуации.
    Высокая Быстрота означает, что персонаж развил ловкость,
    плавность и грацию, возможно, благодаря бегу, боевым искусствам или даже печатанию (что развивает моторику рук).`,
    attributeStrengthDescription: `Сила показывает, на что способны мускулы персонажа. Сила
    в некоторой степени зависит от размера и метатипа персонажа.
    Если ваш персонаж – человеческая девушка ростом 5 футов и
    весом 115 фунтов, вряд ли ее Атрибут Силы без аугментаций
    достигнет 6. С другой стороны, у дварфов плотность мышц сопоставима с таковой плотностью у рептилий (чтобы отразить
    это, на старте персонажи-дварфы получают бонус +2 к Силе).
    Герои с низкой Силой могут быть маленькими, худыми или хрупкими, или просто слишком занятыми, чтобы уделять время тренировкам. Персонаж с высокой Силой волен быть крепким и
    выносливым, знать, как использовать свое тело с максимальной
    выгодой, тренироваться каждый день или просто быть БОЛЬШИМ.`,
    attributeCharismaDescription: `Харизма – неоднозначный атрибут. Это больше, чем просто
    внешний вид. Скорее Харизма представляет собой личную ауру
    обаяния персонажа, его представление о себе, эго, готовность
    видеть, чего хотят люди, и давать им это, а также способность
    распознавать, что он сам может и не может получать от людей. Плаксивое поведение, заносчивость, неспособность читать язык тела или тонкие намеки – вот лишь несколько черт, которые могут быть у персонажа
    с низкой Харизмой. Индивидуум с
    высокой Харизмой может просто
    получать удовольствие, развлекая
    других, в силах искренне помогать
    людям и развивать дружбу, или же
    представать ярким и веселым, с кем
    бы он сегодня ни был. Персонаж с
    высокой Харизмой сумеет пошутить
    в нужный момент, будет знать, как
    выглядеть сексуально или вызывать
    уважение, потому что всегда безупречно подбирает для этого время.`,
    attributeIntellectDescription: `Интеллект представляет собой
    перцептивные и аналитические возможности персонажа, способность к запоминанию и грубую мощь мозга. Он отвечает за
    то, насколько быстро персонаж учится, адаптируется или запоминает. Низкий интеллект не подразумевает глупость; скорее
    это может обозначать персонажа, который слишком быстро
    сбрасывает со счетов вещи, вместо того, чтобы понять, как он
    может их использовать. Такой персонаж может не думать далее
    текущего момента, легко отвлекаться или просто полагаться на
    инстинкты, а не на интеллект. С другой стороны, высокий Интеллект означает, что персонаж способен уследить за несколькими вещами одновременно, объединять старые воспоминания с
    тем, над чем он сейчас работает, и применять общие принципы
    к конкретным проблемам. Такие персонажи замечают мелкие
    детали и быстро учатся – они могут при этом не ходить в школу много лет, но если кто-то компетентный им что-то объяснит,
    они поймут`,
    attributeWillPowerDescription: `Сила воли поддерживает персонажа, когда он уже готов
    сдаться, или позволяет ему контролировать свои привычки
    и эмоции. Сила воли определяет, готов ли персонаж брать на
    себя ответственность за свою жизнь. Например, персонаж с
    низкой Силой воли может идти на поводу у других людей, когда
    принимаются важные решения. Герой же с высокой Силой воли
    более уверен в себе и никогда не сдается. Такие персонажи
    хладнокровно спускаются по мононити, потому что они, фраг
    его, могут.`,
    attributeEntityDescription: `Сущность есть мера жизненной силы, целостности тела.
    Она представляет собой сплоченность и общую гармонию тела.
    Инвазивные для тела вещи, такие как кибервэр, снижают Сущность. Если персонаж неоднократно злоупотребляет химикатами, токсинами или даже просто небрежно относится к своему
    телу в течение длительного периода времени, то он также может потерять Сущность. Заядлые наркоманы и чипоголовые, нанесшие непоправимый вред своему организму, утратили Сущность. Когда Сущность уменьшается, Магия также понижается
    на ту же величину.`,
    attributeMagicDescription: `Магия – это мера способности применять магию и настраиваться на потоки маны, которые текут сквозь наш план. Те, у кого
    высокий рейтинг Магии, способны воплощать мощные чары и
    манипулировать маной. Те, у кого слабый рейтинг Магии, более
    чувствительны и легче истощаются при использовании заклинаний. Те, у кого вовсе нет рейтинга Магии, не имеют магических
    способностей и отрезаны от магических сфер. Серьезные повреждения тела и инвазивные дополнения, такие как кибервэр, опосредовано снижают рейтинг Магии.`,
    attributeReactionDescription: `Реакция определяет, как быстро и как часто персонаж
    способен действовать под давлением. У персонажа с хорошими рефлексами будет высокая Реакция. Рейтинг Реакции – это
    среднее значение Быстроты и Интеллекта, округленное в меньшую сторону.`,
    moreAboutAttribute: 'Подробнее о аттрибутах',
  },
};
