import { ResourceLanguage } from 'i18next';

export const RU_I18N: ResourceLanguage = {
  translation: {
    create: 'Создание персонажа',
    createDescription:
      'Вам необходимо описать вашего персонажа, придумать ему имя, пол, описание и другие дополнительные заметки.',
    back: 'Назад',
    selectPriority: 'К выбору приоритетов',
    fillName: 'Имя персонажа',
    fillDescription: 'Описание персонажа',
    namePlaceholder: 'Джей Кокс',
    appearancePlaceholder:
      'Красив как бог, рыжие и длинные кудри, глаза как небо, немного люменесцентны',
    descriptionPlaceholder:
      'Мой персонаж был рожден в огне, пережил две войны и вернулся на волю',
    genderPlaceholder: 'Мужской',
    genderLabel: 'Выберите пол персонажа',
    appearanceLabel: 'Опишите внешность вашего персонажа',
    male: 'Мужской',
    female: 'Женский',
    other: 'Другой',
    requiredError: 'Необходимо заполнить поле',
    createPriority: 'Таблица приоритетов',
    descriptionPriority:
      'В данном разделе вам необходимо распределить приоритеты для вашего персонажа, тут вы решите будет ли ваш персонаж орком или трллем, полноценным магом или адептом и тп',
    detailPriority:
      'В каждой категории вы можете выбрать только одно, каждый следующий приоритет понижает эффективность',
    next: 'Далее',
    fullMage: 'Полноценный маг',
    aspectMage: 'Аспектный маг',
    adeptMage: 'Адепт',
    createFullMage: 'К созданию полноценного мага',
    createAspectMage: 'К созданию аспектного мага',
    createAdeptMage: 'К созданию адепта',
    priorityNext: 'К распределению аттрибутов',
    attributeTitle: 'Распределение аттрибутов',
    attributeDescription:
      'Аттрибуты вам необходимы для различных проверок, например аттрибут "Сила" будет использоваться, когда вы делаете что то связанное с физической силой',
    attributeNext: 'К распределению умений',
    skillTitle: 'Распределение умений',
    skillDescription:
      'Умения важная часть игры, они вам помогают справляться с различными ситуациями в игре, например навык "Компьютеры" помогает вам разбираться с компьютерами, делать различные манипуляции с ними. Выбирайте умения под свой стиль игры',
    skillNext: 'К распределению знаний',
    knowledgeTitle: 'Распределение знаний',
    knowledgeDescription:
      'Знания расширяют бекграунд вашего персонажа, придумывайте знания в любой форме, любые знания могут пригодиться',
    knowledgeNext: 'К распределению ресурсов',
    resourceTitle: 'Распределение ресурсов',
    resourceDescription:
      'В данный раздел входят различные игровые приспособления, которые помогут вам выбрать персонажа, которого вы хотите отыграть. Тут вы выберите уровень жизни персонажа, киберимпланты, броню, оружие и транспорт',
    finish: 'Закончить создание персонажа',
    human: 'Человек',
    elven: 'Эльф',
    troll: 'Тролль',
    dwarf: 'Дворф',
    orc: 'Орк',
    priorityLabel: 'Приоритет',
    magicalCreateTitle: 'Магия',
    raceCreateTitle: 'Раса',
    attributeCreateTitle: 'Аттрибуты',
    skillCreateTitle: 'Умения',
    resourceCreateTitle: 'Ресурсы',
  },
};
